In [9]:
import pandas as pd 

list1 = [1,2,3]

list1

[1, 2, 3]

In [15]:
series1 = pd.Series(list1, index= ['unu','doi','trei'])

series1

unu     1
doi     2
trei    3
dtype: int64

In [21]:
dataframe1 = pd.DataFrame({'Coloana 1':[11,22,33],
                           'Coloana 2':[12,13,'Abracadabra'],
                           'Coloana 3':[-21.1,9.98,-17.2]})

dataframe1

   Coloana 1    Coloana 2  Coloana 3
0         11           12     -21.10
1         22           13       9.98
2         33  Abracadabra     -17.20

In [ ]:
dataframe1.shape